[
  {
    "path": "/blog/heavy-weights-vs-high-reps-for-runners",
    "slug": "heavy-weights-vs-high-reps-for-runners",
    "title": "Should Runners Lift Heavy? Science Says Yes | StrongerStride",
    "description": "Research shows heavy resistance training improves running economy by 2-8% while high-rep training shows zero performance benefit. Learn why runners should lift heavy weights (80-90% 1-RM, 3-6 reps) and stop wasting time on bodyweight circuits.",
    "image": "https://images.pexels.com/photos/703016/pexels-photo-703016.jpeg",
    "publishedTime": "2025-11-16T16:46:42.605139+00:00",
    "modifiedTime": "2025-12-11T13:52:30.066306+00:00",
    "author": "Dr. Spencer Agnew, DPT",
    "keywords": "should runners lift heavy weights, heavy weights vs high reps for runners, will lifting heavy make me bulky, strength training myths for runners, best rep range for runners"
  },
  {
    "path": "/blog/stride-length-vs-stride-frequency-distance-runners",
    "slug": "stride-length-vs-stride-frequency-distance-runners",
    "title": "Stride Length vs. Stride Frequency for Distance Runners | StrongerStride",
    "description": "Research reveals distance runners rely on ankle strength for stride length, not hip muscles like sprinters. Learn which muscles power YOUR race pace, why the 7 m/s threshold matters, and how to train the right muscles for maximum performance.",
    "publishedTime": "2025-11-12T15:10:35.913484+00:00",
    "modifiedTime": "2025-12-11T13:52:35.302547+00:00",
    "author": "Dr. Spencer Agnew, DPT",
    "keywords": "stride length, stride frequency, cadence, running speed, calf strength, soleus muscle, ankle plantarflexors, distance running, running biomechanics, running performance"
  },
  {
    "path": "/blog/calf-strength-distance-runners",
    "slug": "calf-strength-distance-runners",
    "title": "Why Calf Strength Matters for Distance Runners | Stronger Stride",
    "description": "Research shows calf muscles are the primary drivers of distance running performance up to 4:17/mile pace. Learn why your calves matter more than your quads, what tests reveal about your weakness, and the 5 exercises that build race-winning calf strength.",
    "image": "https://images.pexels.com/photos/2803158/pexels-photo-2803158.jpeg",
    "publishedTime": "2025-11-06T00:00:00+00:00",
    "modifiedTime": "2025-12-11T13:52:18.278409+00:00",
    "author": "Dr. Spencer Agnew, DPT",
    "keywords": "running, injury prevention, strength training, biomechanics, calf strength, running performance, soleus, gastrocnemius, Achilles tendon"
  },
  {
    "path": "/blog/hip-strength-running-performance",
    "slug": "hip-strength-running-performance",
    "title": "Why Hip Strength Matters for Running Performance | StrongerStride",
    "description": "Discover why hip strength is crucial for injury prevention and running performance. Research-backed guide with 5 best exercises, training programs, and recovery protocols.",
    "publishedTime": "2025-11-05T18:25:36.679468+00:00",
    "modifiedTime": "2025-11-05T18:25:36.679468+00:00",
    "author": "Dr. Spencer Agnew, DPT",
    "keywords": "hip strength running, running injuries, hip exercises for runners, glute strength, IT band prevention, runner knee pain, hip abductor exercises, running performance"
  },
  {
    "path": "/blog/it-band-syndrome-runners-hip-strength",
    "slug": "it-band-syndrome-runners-hip-strength",
    "title": "IT Band Syndrome: Why Hip Strength is the Real Solution | StrongerStride",
    "description": "Discover why IT band syndrome is caused by weak hips, not a tight IT band. Research shows 92% recovery with hip strengthening. Learn the 5 best exercises and recovery protocol to fix IT band pain permanently.",
    "publishedTime": "2025-11-04T00:00:00+00:00",
    "modifiedTime": "2025-11-05T18:27:17.009576+00:00",
    "author": "Dr. Spencer Agnew, DPT",
    "keywords": "IT band syndrome, ITBS, iliotibial band syndrome, runner knee pain, hip strength, IT band exercises, running injuries, knee pain running, IT band treatment, hip abductor weakness"
  }
]